# Data wrangling

In [149]:
# Importing Libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [150]:
# importing data sets
kashti = pd.read_csv("kashti.csv")
ks1 = kashti
ks2 = kashti

In [ ]:
kashti.head(3)

In [ ]:
# simple operation (math opeerations)
(kashti["age"]+1).head(3)
(kashti["age"]*2).head(3)

### Dealing with missing values
- missing values are either N/A, NaN, 0 and Blanks
- if it does't effect the data remove the column or row or specific data enty
#### Replace the missing value
1-HOW?
- Average of entire variable
- frequency or mode replacements
- replace based on other fuctions (data sampler know that)
- ML can also be used
- leave it like that

2-why?
- its better because no data is lost
- less accurate if data is loss

In [ ]:
# where exactly missing values are?
kashti.isnull().sum()

In [ ]:
print(kashti.shape)

In [ ]:
# Use drop.na method
kashti.dropna(subset=["deck"], axis=0, inplace=False) # this will remove the null values from deck rows
# inplace = true modifies the data frame

In [ ]:
# find again null values
kashti.isnull().sum()

In [ ]:
# check again the shape
print(kashti.shape)

In [ ]:
# to update the main data farame
kashti = kashti.dropna()
kashti.isnull().sum() #remove NA from whole data frame

In [ ]:
# check the shape again
kashti.shape

In [ ]:
ks1.isnull().sum()

## Replacing missing values with the Avg: of that column

In [ ]:
#finding an avg
mean = ks1["age"].mean()
mean

In [ ]:
# Replacing NaN with the mean of age column
ks1["age"] = ks1["age"].replace(np.nan, mean)

In [ ]:
ks1.isnull().sum()

## Data Formating
- Data format is a standard of dataclass
- Ensure that data is consistant and uderstandable
    - Easy to gather
    - Easy to workwith
    
        - convert g to kg or similar unit for all

In [ ]:
# know that the data type and convert it into the known one
kashti.dtypes

In [ ]:
# convert data type to another data types
kashti["survived"] = kashti["survived"].astype("int64")
kashti.dtypes

In [ ]:
# Convert age to days instead of years
ks1["age"] = ks1["age"]*365
ks1.head(3)

In [ ]:
# Rename the columns names
ks1.rename(columns={"age":"age_in_days"}, inplace=True)
ks1.head(3)

### Data Normalization
- Bell-curve are normalize data
- Uniform the data
- Making user they have same impact
- one fish in sea and the other in jar 
- Also for computation reasons

In [ ]:
kashti.head()

In [ ]:
ks4 = ks1[["age_in_days","fare"]]
ks4.head(3)

- The above data is really in wide range and need to normalize because its hard to compare
- Normalization change the values to the range of 0 to -1 (now both variables has similar ifluence on our model)

### Method of Normalization
- Simple feature scaling
    - x(new)=x(old)/x(max)
- Min-Max Method
- Z-score (standard score) -3 to +3
- Log Transformation

In [ ]:
# Simple Feature method
ks4["fare"] = ks4["fare"]/ks4["fare"].max()
ks4.head(3)

In [ ]:
# Simple Feature method
ks4["age_in_days"] = ks4["age_in_days"]/ks4["age_in_days"].max()
ks4.head(3)

In [ ]:
# Min-Max Method 

ks4["fare"] = (ks4["fare"]-ks4["fare"].min()) / (ks4["fare"].max()-ks4["fare"].min())
ks4.head(3)

In [ ]:
# Min-Max Method 

ks4["age_in_days"] = (ks4["age_in_days"]-ks4["age_in_days"].min()) / (ks4["age_in_days"].max()-ks4["age_in_days"].min())
ks4.head(3)

In [ ]:
# Z-Score (Standard score)
ks4["fare"] = (ks4["fare"]-ks4["fare"].mean()) / ks4["fare"].std()
ks4.head(3)

In [ ]:
# Z-Score (Standard score)
ks4["age_in_days"] = (ks4["age_in_days"]-ks4["age_in_days"].mean()) / ks4["age_in_days"].std()
ks4.head(3)

In [ ]:
# Log Transforation
ks4["fare"] = np.log(ks4["fare"])
ks4.head(3)

### **Binning**
- Grouping of values into smaller number of values (bins)
- convert numeric into categories (jawan, Bache, borhy) or 1-16, 17-30, 31-60 etc.
- To have better understanding of groups.
  - Low vs Mid vs High Prices

In [ ]:
min_value = kashti['age'].min()
max_value = kashti['age'].max()
print(min_value)
print(max_value)

In [ ]:
bins = np.linspace(min_value, max_value, 4)
age_groups = ["Bachy", "Jawan", "Boorhy"]
kashti["age"] = pd.cut(kashti["age"], bins, labels=age_groups, include_lowest=True)
kashti["age"]
# How this will change the names in dataset based on grouping? (Assignents)

In [ ]:
kashti.head(3)

In [ ]:
kashti["age"].astype(str)

In [ ]:
kashti.dtypes

In [ ]:
# ploting the binning "age" categories
plt.hist(kashti['age'], bins=3)
plt.show()

### **Converting categories into dummies**
- easy to use for computaton 
- male Female (0,1)

In [ ]:
pd.get_dummies(ks1, columns=["sex"])
# how to use get dummies to change data into a dataframe (Assignments)

In [152]:
type_dummies = pd.get_dummies(ks1['sex'],drop_first=True)  
ks1 = pd.concat([ks1,type_dummies],axis=1)

In [154]:
ks1["male"]

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: male, Length: 891, dtype: uint8

In [155]:
ks1.rename(columns={"male":"Sex"}, inplace=True)
ks1.head(3)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Sex
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0

In [157]:
ks1.drop(["sex"], axis=1)

,Unnamed: 0,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Sex
0,0,0,3,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,1,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,2,1,3,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0
3,3,1,1,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,4,0,3,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,887,1,1,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,888,0,3,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,0
889,889,1,1,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,890,0,3,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [158]:
ks1.head(3)

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Sex
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0